/*
 *  Copyright (C) 2003-2018  Anders Gavare.  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright  
 *     notice, this list of conditions and the following disclaimer in the 
 *     documentation and/or other materials provided with the distribution.
 *  3. The name of the author may not be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 *  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE   
 *  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 *  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 *  OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 *  HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 *  LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 *  OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 *  SUCH DAMAGE.
 *   
 *
 *  COMMENT: SGI "Graphics Back End", graphics controller + framebuffer
 *
 *  Guesswork, based on how Linux, NetBSD, and OpenBSD use the graphics on
 *  the SGI O2. Using NetBSD terminology (from crmfbreg.h):
 *
 *	0x15001000	rendering engine (TLBs)
 *	0x15002000	drawing engine
 *	0x15003000	memory transfer engine
 *	0x15004000	status registers for drawing engine
 *
 *	0x16000000	crm (or gbe) framebuffer control / video output
 *
 *  According to https://www.linux-mips.org/wiki/GBE, the GBE is also used in
 *  the SGI Visual Workstation.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "console.h"
#include "cpu.h"
#include "devices.h"
#include "machine.h"
#include "memory.h"
#include "misc.h"

#include "thirdparty/crmfbreg.h"
#include "thirdparty/sgi_gl.h"


/*  Let's hope nothing is there already...  */
#define	FAKE_GBE_FB_ADDRESS	0x380000000

#define	ZERO_CHUNK_LEN		4096

// #define	GBE_DEBUG
// #define debug fatal

#define	GBE_DEFAULT_XRES		1280
#define	GBE_DEFAULT_YRES		1024
#define	GBE_DEFAULT_BITDEPTH		8


struct sgi_gbe_data {
	// CRM / GBE registers:
	int		xres, yres;

	uint32_t	ctrlstat;		/* 0x00000  */
	uint32_t	dotclock;		/* 0x00004  */
	uint32_t	i2c;			/* 0x00008  */
	uint32_t	i2cfp;			/* 0x00010  */

	uint32_t	tilesize;		/* 0x30000  */
	uint32_t	frm_control;		/* 0x3000c  */
	int		freeze;

	uint32_t	palette[256];		/* 0x50000  */

	uint32_t	cursor_pos;		/* 0x70000  */
	uint32_t	cursor_control;		/* 0x70004  */
	uint32_t	cursor_cmap0;		/* 0x70008  */
	uint32_t	cursor_cmap1;		/* 0x7000c  */
	uint32_t	cursor_cmap2;		/* 0x70010  */
	uint32_t	cursor_bitmap[64];	/* 0x78000  */

	// Emulator's representation:
	int 		width_in_tiles;
	int		partial_pixels;
	int		bitdepth;
	int		color_mode;
	struct vfb_data *fb_data;

	// Rendering engine registers:
	uint16_t	re_tlb_a[256];
	uint16_t	re_tlb_b[256];
	uint16_t	re_tlb_c[256];
	uint16_t	re_tex[112];
	// todo: clip_ids registers.
	uint32_t	re_linear_a[32];
	uint32_t	re_linear_b[32];

	// Drawing engine registers:
	uint32_t	de_reg[DEV_SGI_DE_LENGTH / sizeof(uint32_t)];

	// Memory transfer engine registers:
	uint32_t	mte_reg[DEV_SGI_MTE_LENGTH / sizeof(uint32_t)];
};


void get_rgb(struct sgi_gbe_data *d, uint32_t color, uint8_t* r, uint8_t* g, uint8_t* b)
{
	switch (d->color_mode) {
	case CRMFB_MODE_TYP_I8:
		color &= 0xff;
		*r = d->palette[color] >> 24;
		*g = d->palette[color] >> 16;
		*b = d->palette[color] >> 8;
		break;
	case CRMFB_MODE_TYP_RG3B2:	// Used by NetBSD
		*r = (color >> 5) << 5;	if (*r & 0x20) *r |= 0x1f;
